{
  "title": "SUPERMAN 4+ (com.macjutsu.super)",
  "description": "Preference settings for the S.U.P.E.R.M.A.N 4+ updating script",
  "properties": {
    "AuthJamfComputerID": {
      "title": "AuthJamfComputerID: The ID of the computer in Jamf",
      "description": "This is required if using the JAMF API & Bootstrap token to provide authentication to the softwareupdate mechanism on Apple Silicon Macs.",
      "property_order": 5,
      "type": "string",
      "options": {
        "enum_titles": [
          "$JSSID"
        ]
      },
      "enum": [
        "$JSSID"
      ]
    },
    "InstallMacOSMajorUpgrades": {
      "title": "InstallMacOSMajorUpgrades: Allow Major Upgrades",
      "description": "This option can automatically enforce all contemporary macOS upgrade workflows from macOS 11 and newer. This includes support for Intel, Apple Silicon via local authentication, Apple Silicon via Jamf Pro API authentication, and Apple Silicon user request (similar to Nudge).",
      "property_order": 10,
      "type": "boolean"
    },
    "InstallMacOSMajorVersionTarget": {
      "title": "InstallMacOSMajorVersionTarget: Target Upgrade Version",
      "description": "This option allows you to specify a major macOS version (12, 13, or 14) as the maximum allowed macOS upgrade.",
      "property_order": 15,
      "type": "string"
    },
    "InstallRapidSecurityResponses": {
      "title": "InstallRapidSecurityResponses: Allow RSR Updates",
      "description": "This option must be specified to install RSR updates, otherwise the default super behavior is to not install RSR updates.",
      "property_order": 20,
      "type": "boolean"
    },
    "InstallNonSystemUpdatesWithoutRestarting": {
      "title": "InstallNonSystemUpdatesWithoutRestarting: Enforce Non System Updates",
      "description": "This will install all recommended (non-macOS) updates silently in the background even if there is no macOS update or upgrade required. Without using this option, the default behavior is to install recommended updates only after a macOS update/upgrade restart.",
      "property_order": 25,
      "type": "boolean"
    },
    "WorkflowOnlyDownload": {
      "title": "WorkflowOnlyDownload: Only Download",
      "description": "This workflow option allows you to pre-cache (but not install) macOS update/upgrades silently in the background. This significantly shortens the restart time when an installation workflow is started. This option always keeps the latest available macOS updates and allowed macOS upgrades ready for installation.",
      "property_order": 30,
      "type": "boolean"
    },
    "WorkflowZeroDateManual": {
      "title": "WorkflowZeroDateManual: On this date, the computer restarts and updates without asking the user for approval.",
      "description": "Example (YYYY-MM-DD:hh:mm) If this date has passed, the computer restarts and updates without asking the user for approval. However, the user is notified that a restart is pending. At a minimum, you must always specify year-month-day. Hours are represented by a 24-hour clock, and any non-specified hours or minutes are rounded to 00. Additionally, other maximum deferral count or maximum days deadlines that have passed can override this option. For testing use a date and time value in the past to simulate being past this date deadline.",
      "property_order": 35,
      "type": "string"
    },
    "WorkflowDisableUpdateCheck": {
      "title": "WorkflowDisableUpdateCheck: Skip installing updates and only run jamf policies",
      "description": "Skip Apple software updates, even if they are available. This option can also be used along with --workflow-restart-without-updates and --workflow-jamf-policy-triggers to only run Jamf Pro Polices and then restart the computer while still taking advantage of notifications, dialogs, deferrals, and deadline options. Alternatley, use this option along with --reset-super to clear any super preferences, kill any existing super processes and delete the super LaunchDaemon.",
      "property_order": 40,
      "type": "boolean"
    },
    "WorkflowDisableRelaunch": {
      "title": "WorkflowDisableRelaunch: Disable Recheck.",
      "description": "This option prevents super from checking for new updates/upgrades on a reoccurring basis.",
      "property_order": 45,
      "type": "boolean"
    },
    "WorkflowJamfPolicyTriggers": {
      "title": "WorkflowJamfPolicyTriggers: JAMF triggers to run",
      "description": "Example (slack,chromeinstall,policy1) One or more Jamf Pro Policy Triggers that are comma separated with no spaces. If a restart is required for system updates or forced via --workflow-restart-without-updates, this list of Jamf Policy Triggers runs before any available updates install and the computer restarts. This option can also be used along with the --workflow-disable-update-check option to run only the Jamf Policy Triggers.",
      "property_order": 50,
      "type": "string"
    },
    "WorkflowRestartWithoutUpdates": {
      "title": "WorkflowRestartWithoutUpdates: Force restart even if software updates don't require it",
      "description": "Force a restart even if Apple software updates do not need it. Useful when used along with --test-mode or if no updates are available but you still want to use --workflow-jamf-policy-triggers and then restart.",
      "property_order": 55,
      "type": "boolean"
    },
    "DeferralTimerDefault": {
      "title": "DeferralTimerDefault: Deferral Default time in minutes",
      "description": "The number of minutes to defer until the next update attempt if a user choses not to update restart. This deferral time is also used in cases when a required service is temporarily unavailable (for example, network or Jamf Pro connectivity issues). Using this option overrides the default deferral time which is set to 60 minutes (1 hour).",
      "property_order": 60,
      "type": "string"
    },
    "DeferralTimerMenu": {
      "title": "DeferralTimerMenu: Deferral options to show in the drop down menu",
      "description": "Example (120,240,1440) Display a deferral time pop-up menu in the non-deadline update restart dialog that allows the user to overide the default defer time. The time selections are specified with one or more number of minutes that are comma separated with no spaces. The first number in the list is the default selection for the menu, thus it will be automatically selected.",
      "property_order": 65,
      "type": "string"
    },
    "DeferralTimerFocus": {
      "title": "DeferralTimerFocus: Default defer amount in minutes for Focus or Do Not Disturb mode",
      "description": "The number of minutes to defer the update restart dialog automatically if a process has prevented display sleep (for example, during an active meeting) or the user has Focus or Do Not Disturb enabled. With this option you should also consider using either of --deadline-date-focus, --deadline-days-focus, --deadline-count-focus and either of --deadline-date-soft, --deadline-days-soft, --deadline-count-soft to ensure users are offered a chance to defer before a required update restart is enforced via either of --deadline-date-hard, --deadline-days-hard, --deadline-count-hard=number.",
      "property_order": 70,
      "type": "string"
    },
    "DeferralTimerError": {
      "title": "DeferralTimerError: The number of minutes to defer deferral time specifically for errors",
      "description": "Example (5) This option allows you to set a deferral time specifically for errors (as opposed to using the default defer time).",
      "property_order": 75,
      "type": "string"
    },
    "DeferralTimerWorkflowRelaunch": {
      "title": "DeferralTimerWorkflowRelaunch: The number of minutes to defer if no software updates are found",
      "description": "The number of minutes to defer if no software updates are found. Enabling this option results in super acting as a permanent agent that checks for software updates on a regular basis. Logically, this option can not be used along with the --workflow-disable-update-check.",
      "property_order": 80,
      "type": "string"
    },
    "DeadlineCountFocus": {
      "title": "DeadlineCountFocus: The maximum number of automatic deferrals allowed if the system is in user-enabled Focus/Do Not Disturb or when a process has requested that the display not go to sleep (for example, during an active meeting).",
      "description": "The maximum number of automatic deferrals allowed if the system is in user-enabled Focus/Do Not Disturb or when a process has requested that the display not go to sleep (for example, during an active meeting). After this deadline the update restart dialogs always appear as normal. With this option you should also consider setting a specific --deferral-timer-focus time, otherwise the focus deferment time is based on the --deferral-timer-default. Note that if a user is always in a Focus mode, the --deadline-count-focus deadline must pass first before the --deadline-count-soft or --deadline-count-hard options are started. Additionally, other maximum days or date deadlines that have passed can override this option. For testing, use a number value of 0 to simulate being past the maximum focus count deadline.",
      "property_order": 85,
      "type": "string"
    },
    "DeadlineCountSoft": {
      "title": "DeadlineCountSoft: The maximum number of user selected deferrals allowed before the soft deadline dialog.",
      "description": "The maximum number of user selected deferrals allowed before the soft deadline dialog. The soft deadline is an interactive update restart dialog indicating that no more deferrals are allowed. This option can not be used along with the --deadline-date-hard option as logically there can only be one behavior after passing the maximum number of user deferrals. Note that if this option is also used with the --deadline-count-focus option and the user is always in a Focus mode, then the --deadline-count-focus must pass first before the --deadline-count-soft is started. Additionally, other maximum days or date deadlines that have passed can override this option. For testing, use a number value of 0 to simulate being past the maximum soft count deadline.",
      "property_order": 90,
      "type": "string"
    },
    "DeadlineCountHard": {
      "title": "DeadlineCountHard: The maximum number of user selected deferrals allowed before the computer automatically restarts for updates without asking the user for approval.",
      "description": "The maximum number of user selected deferrals allowed before the computer automatically restarts for updates without asking the user for approval. However, the user is notified that a restart is pending. This option can not be used along with the --deadline-date-soft option as logicially there can only be one behavior after passing the maximum number of user deferrals. Note that if this option is also used with the --deadline-count-focus option and the user is always in a Focus mode, then the --deadline-count-focus deadline must pass first before the --deadline-count-hard is started. Additionally, other maximum days or date deadlines that have passed can override this option. For testing, use a number value of 0 to simulate being past the maximum hard count deadline.",
      "property_order": 95,
      "type": "string"
    },
    "DeadlineDaysFocus": {
      "title": "DeadlineDaysFocus: The maximum number of days that automatic deferrals are allowed if the system is in user-enabled Focus/Do Not Disturb or when a process has requested that the display not go to sleep (for example, during an active meeting).",
      "description": "The maximum number of days that automatic deferrals are allowed if the system is in user-enabled Focus/Do Not Disturb or when a process has requested that the display not go to sleep (for example, during an active meeting). After this deadline the update restart dialogs always appear. With this option you should also consider setting a specific --deferral-timer-focus, otherwise the focus deferment time is be based on the --deferral-timer-default time. Note that when used along with the --deadline-days-soft or --deadline-days-hard options, logically the --deadline-date-focus value must always be the least number of days. Additionally, other maximum deferral count or date deadlines that have passed can override this option. For testing, use a day value of 0 or the --workflow-zero-date-manual option to' simulate being past the maximum number of days deadline.",
      "property_order": 100,
      "type": "string"
    },
    "DeadlineDaysSoft": {
      "title": "DeadlineDaysSoft: The maximum number of days allowed before the soft deadline dialog.",
      "description": "The maximum number of days allowed before the soft deadline dialog. The soft deadline is an interactive update restart dialog indicating that no more deferrals are allowed. Note that when used along with the --deadline-days-focus or --deadline-days-hard options, logically the --deadline-days-soft value must always be more than the --deadline-days-focus value and less than the --deadline-days-hard value. Additionally, other maximum deferral count or date deadlines that have passed can override this option. For testing, use a day value of 0 or the --workflow-zero-date-manual option to simulate being past the maximum number of days deadline.",
      "property_order": 105,
      "type": "string"
    },
    "DeadlineDaysHard": {
      "title": "DeadlineDaysHard: The maximum number of days allowed before the computer automatically restarts for updates without asking the user for approval.",
      "description": "The maximum number of days allowed before the computer automatically restarts for updates without asking the user for approval. However, the user is notified that a restart is pending. Note that when used along with the --deadline-days-focus or --deadline-days-soft options, logically the --deadline-days-hard value must always be the most number of days. Additionally, other maximum deferral count or date deadlines that have passed can override this option. For testing, use a day value of 0 or the --workflow-zero-date-manual option to simulate being past the maximum number of days deadline.",
      "property_order": 110,
      "type": "string"
    },
    "DeadlineDateFocus": {
      "title": "DeadlineDateFocus: This is the last date and time when automatic deferrals are allowed if the system is in user-enabled Focus/Do Not Disturb or when a process has requested that the display not go to sleep.",
      "description": "Example (YYYY-MM-DD:hh:mm) This is the last date and time when automatic deferrals are allowed if the system is in user-enabled Focus/Do Not Disturb or when a process has requested that the display not go to sleep (for example, during an active meeting). After this deadline the update restart dialogs always appear. At a minimum, you must always specify year-month-day. Hours are represented by a 24-hour clock, and any non-specified hours or minutes are rounded to 00. Note that when used along with the --deadline-date-soft or --deadline-date-hard options, the --deadline-date-focus value must always be the earliest in time. Additionally, other maximum deferral count or maximum days deadlines that have passed can override this option. For testing use a date and time value in the past to simulate being past this date deadline.",
      "property_order": 115,
      "type": "string"
    },
    "DeadlineDateSoft": {
      "title": "DeadlineDateSoft: If this date and time have passed, an interactive update restart dialog appears indicating that no more user deferrals are allowed.",
      "description": "Example (YYYY-MM-DD:hh:mm) If this date and time have passed, an interactive update restart dialog appears indicating that no more user deferrals are allowed. At a minimum, you must always specify year-month-day. Hours are represented by a 24-hour clock, and any non-specified hours or minutes are rounded to 00. Note that when used along with the --deadline-date-focus or --deadline-date-hard options, the --deadline-date-soft value must always be after the --deadline-date-focus in time but before the --deadline-date-hard in time. Additionally, other maximum deferral count or maximum days deadlines that have passed can override this option. For testing use a date and time value in the past to simulate being past this date deadline.",
      "property_order": 120,
      "type": "string"
    },
    "DeadlineDateHard": {
      "title": "DeadlineDateHard: If this date has passed, the computer restarts and updates without asking the user for approval.",
      "description": "Example (YYYY-MM-DD:hh:mm) If this date has passed, the computer restarts and updates without asking the user for approval. However, the user is notified that a restart is pending. At a minimum, you must always specify year-month-day. Hours are represented by a 24-hour clock, and any non-specified hours or minutes are rounded to 00. Note that when used along with the --deadline-date-focus or --deadline-date-soft options, the --deadline-date-hard value must always be the latest in time. Additionally, other maximum deferral count or maximum days deadlines that have passed can override this option. For testing use a date and time value in the past to simulate being past this date deadline.",
      "property_order": 125,
      "type": "string"
    },
    "DialogTimeoutDefault": {
      "title": "DialogTimeoutDefault: Countdown timeout for update notifications in seconds",
      "description": "Allows you to set a timeout (in seconds) for the restart or defer dialog (default is no timeout). If the user doesn't make a selection to restart or defer within this timeout then the workflow automatically defers.",
      "property_order": 130,
      "type": "string"
    },
    "DialogTimeoutRestartOrDefer": {
      "title": "DialogTimeoutRestartOrDefer: The maximum number of days allowed before the computer automatically restarts for updates without asking the user for approval.",
      "description": "Example (YYYY-MM-DD:hh:mm) Instead of having the days deadline counter automatically select the day zero date, this option sets a specific date and time as day zero. Note that you need to manually update this value every time you want to set a new day zero.",
      "property_order": 135,
      "type": "string"
    },
    "DialogTimeoutSoftDeadline": {
      "title": "DialogTimeoutSoftDeadline: Countdown timeout for update notifications in seconds",
      "description": "Allows you to set a timeout (in seconds) for the soft deadline restart dialog (default is no timeout). If the user doesn't choose to restart within this timeout then the workflow automatically starts the macOS update/upgrade restart.",
      "property_order": 140,
      "type": "string"
    },
    "DialogTimeoutUserAuth": {
      "title": "DialogTimeoutUserAuth: User Authentication Timeout",
      "description": "This option allows you to set a timeout (in seconds) for the macOS update/upgrade via user authentication dialog (default is no timeout). If the user doesn't authenticate the macOS update/upgrade within this timeout then the workflow exits.",
      "property_order": 145,
      "type": "string"
    },
    "DialogTimeoutInsufficientStorage": {
      "title": "DialogTimeoutInsufficientStorage: Free Space Timeout",
      "description": "This option allows you to set a timeout (in seconds) for the required available free space notification (default is one hour). If the minimum available free space requirement is not met within this timeout then the workflow automatically defers.",
      "property_order": 150,
      "type": "string"
    },
    "DialogTimeoutPowerRequired": {
      "title": "DialogTimeoutPowerRequired: Battery Timeout",
      "description": "This option allows you to set a timeout (in seconds) for the AC power required notification (default is one hour). If AC power is not connected within this timeout then the workflow automatically defers.",
      "property_order": 155,
      "type": "string"
    },
    "DisplayUnmovable": {
      "title": "DisplayUnmovable: Prevent notification from being moved or closed",
      "description": "Prevents a user ignoring a notification or dialog (for example, moving offscreen).",
      "property_order": 160,
      "type": "string",
      "options": {
        "enum_titles": [
          "Always"
        ]
      },
      "enum": [
        "ALWAYS"
      ]
    },
    "DisplayHideBackground": {
      "title": "DisplayHideBackground: Hide background",
      "description": "Option hides (via translucent blur) the background when displaying dialogs and notifications.",
      "property_order": 165,
      "type": "string",
      "options": {
        "enum_titles": [
          "ALWAYS - Modify display behavior for all dialogs and notifications.",
          "SOFT - Modify display behavior for Dialogs and notifications during a soft deadline.",
          "HARD - Modify display behavior for Dialogs and notifications during a soft deadline.",
          "INSTALLNOW - Modify display behavior for Dialogs and notifications during the install now workflow.",
          "DEFER - Modify display behavior for the defer or restart dialog.",
          "USERAUTH - Modify display behavior for the user authentication dialog.",
          "POWER - Modify display behavior for the power required notification.",
          "STORAGE - Modify display behavior for the insufficient storage notification."
        ]
      },
      "enum": [
        "ALWAYS",
        "SOFT",
        "HARD",
        "INSTALLNOW",
        "DEFER",
        "USERAUTH",
        "POWER",
        "STORAGE"
      ]
    },
    "DisplaySilently": {
      "title": "DisplaySilently: Options modify display behavior",
      "description": "Allows for selectable display type behavior.",
      "property_order": 170,
      "type": "string",
      "options": {
        "enum_titles": [
          "ALWAYS - Modify display behavior for all dialogs and notifications.",
          "SOFT - Modify display behavior for Dialogs and notifications during a soft deadline.",
          "HARD - Modify display behavior for Dialogs and notifications during a soft deadline.",
          "INSTALLNOW - Modify display behavior for Dialogs and notifications during the install now workflow.",
          "DEFER - Modify display behavior for the defer or restart dialog.",
          "USERAUTH - Modify display behavior for the user authentication dialog.",
          "POWER - Modify display behavior for the power required notification.",
          "STORAGE - Modify display behavior for the insufficient storage notification."
        ]
      },
      "enum": [
        "ALWAYS",
        "SOFT",
        "HARD",
        "INSTALLNOW",
        "DEFER",
        "USERAUTH",
        "POWER",
        "STORAGE"
      ]
    },
    "DisplayIconFile": {
      "title": "DisplayIconFile: Path to Icon to display in notifications",
      "description": "Example (/Library/Application Support/icon.icns) Local path or http(s) URL to a file that is the picture to display in notifications or dialogs.",
      "property_order": 175,
      "type": "string"
    },
    "DisplayIconSize": {
      "title": "DisplayIconSize: Icon Size in Pixels",
      "description": "Example (512) Number of pixels for the icon in dialogs. Using this option overrides the default icon size which is set to 96 pixels. Any size less than 32 pixles or more than 150 pixles is rounded accordingly.",
      "property_order": 180,
      "type": "string"
    },
    "DisplayAccessoryType": {
      "title": "DisplayAccessoryType: Display Accessory Type",
      "description": "This option (TEXTBOX, , HTML, IMAGE, VIDEO, VIDEOAUTO) allows you to specify a custom display accessory view for interactive dialogs. Must be used with Display Accessory content files.",
      "property_order": 185,
      "type": "string",
      "options": {
        "enum_titles": [
          "None",
          "Display plain text or Markdown styled text in a white box inside interactive dialogs.",
          "Display HTML styled text in a white box inside interactive dialogs.",
          "Display HTML styled text with a blank background as if part of the interactive dialogs.",
          "Display an image inside the interactive dialogs.",
          "Display a paused video inside the interactive dialogs.",
          "Display a video that will auto-play inside the interactive dialogs."
        ]
      },
      "enum": [
        "X",
        "TEXTBOX",
        "HTMLBOX",
        "HTML",
        "IMAGE",
        "VIDEO",
        "VIDEOAUTO"
      ]
    },
    "DisplayAccessoryDefaultFile": {
      "title": "DisplayAccessoryDefaultFile: Display Accessory Default",
      "description": "This shows the display accessory content for all macOS updates and upgrades. This option can accept a local path or a web URL. If the specified local path or URL can not be found then the custom display accessory will not be shown. Must be used with DisplayAccessoryType.",
      "property_order": 190,
      "type": "string"
    },
    "DisplayAccessoryUpdateFile": {
      "title": "DisplayAccessoryUpdateFile: Display Accessory Update",
      "description": "This shows the display accessory content for only macOS updates. This option can accept a local path or a web URL. If the specified local path or URL can not be found then the custom display accessory will not be shown. Must be used with DisplayAccessoryType.",
      "property_order": 195,
      "type": "string"
    },
    "DisplayAccessoryUpgradeFile": {
      "title": "DisplayAccessoryUpgradeFile: Display Accessory Upgrade",
      "description": "This shows the display accessory content for only macOS upgrades. This option can accept a local path or a web URL. If the specified local path or URL can not be found then the custom display accessory will not be shown. Must be used with DisplayAccessoryType.",
      "property_order": 200,
      "type": "string"
    },
    "DisplayAccessoryUserAuthFile": {
      "title": "DisplayAccessoryUserAuthFile: Display Accessory User Auth",
      "description": "This shows the display accessory content for only macOS updates. This option can accept a local path or a web URL. If the specified local path or URL can not be found then the custom display accessory will not be shown. Must be used with DisplayAccessoryType.",
      "property_order": 205,
      "type": "string"
    },
    "DisplayHelpButtonString": {
      "title": "DisplayHelpButtonString: Help Button",
      "description": "This option allows you to specify a help button (ex: https://support.apple.com/en-us/HT201541).",
      "property_order": 210,
      "type": "string"
    },
    "DisplayWarningButtonString": {
      "title": "DisplayWarningButtonString: Warning Button",
      "description": "This option allows you to specify a warning button (ex: https://support.apple.com/en-us/HT201222).",
      "property_order": 215,
      "type": "string"
    },
    "AuthAskUserToSavePassword": {
      "title": "AuthAskUserToSavePassword: Ask User To Save Password",
      "description": "This option will save the user password to their keychain for later use.",
      "property_order": 220,
      "type": "boolean"
    },
    "AuthJamfCustomURL": {
      "title": "AuthJamfCustomURL: Override Default Jamf Pro URL",
      "description": "This option allows you to override the default Jamf Pro management URL for a custom Jamf Pro API URL.",
      "property_order": 225,
      "type": "string"
    },
    "AuthCredentialFailoverToUser": {
      "title": "AuthCredentialFailoverToUser: Incorrect Credential Failover",
      "description": "This option enables fail over to user authentication if any new or previously saved authentication option fails.",
      "property_order": 230,
      "type": "boolean"
    },
    "AuthMDMFailoverToUser": {
      "title": "AuthMDMFailoverToUser: User Authentication MDM Failover",
      "description": "This option (ALWAYS,NOSERVICE,SOFT,HARD,INSTALLNOW,BOOTSTRAP) allows you to specify when the macOS update/upgrade via user authentication workflow should be used as a failover for when the macOS update/upgrade via MDM workflow fails.",
      "property_order": 235,
      "type": "string"
    },
    "TestMode": {
      "title": "TestMode: Testing mode",
      "description": "Mode to validate parameters, credentials, notifications, dialogs, deferrals, and deadline logic. This mode does not attempt any Apple software updates, Jamf Polices, or restarts. Thus, allowing for quick iteration testing.",
      "property_order": 240,
      "type": "boolean"
    },
    "TestModeTimeout": {
      "title": "TestModeTimeout: Testing mode timeout in seconds",
      "description": "Example (30) The amount of time in seconds to leave test notifications and dialogs open before moving on in the workflow. Using this option overrides the default test mode timeout which is set to 10 seconds.",
      "property_order": 245,
      "type": "string"
    },
    "TestStorageUpdate": {
      "title": "TestStorageUpdate: Testing storage space in GB",
      "description": "Example (25) The amount of simulated storage space available for updates.",
      "property_order": 246,
      "type": "string"
    },
    "TestStorageUpgrade": {
      "title": "TestStorageUpgrade: Testing storage space in GB",
      "description": "Example (25) The amount of simulated storage space available for upgrades.",
      "property_order": 250,
      "type": "string"
    },
    "TestBatteryLevel": {
      "title": "TestBatteryLevel: Testing battery percentage",
      "description": "Example (75) The amount of simulated battery charge avaialable.",
      "property_order": 255,
      "type": "string"
    },
    "VerboseMode": {
      "title": "VerboseMode: Verbose Mode",
      "description": "Mode to generate additional log output. Note that with this mode passwords are visible in Terminal but are not saved to the super log.",
      "property_order": 260,
      "type": "boolean"
    }
  }
}